soapservice/testrequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:gs="countries">
    <soapenv:Header />
    <soapenv:Body>
        <gs:findCountriesRequest>
            <gs:name>Finland</gs:name>
        </gs:findCountriesRequest>
    </soapenv:Body>
</soapenv:Envelope>